In [1]:
import pandas as pd

#DataFrame is the basic datastructure of Pandas
df = pd.read_csv('nyc_weather.csv')

In [2]:
#Head
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [9]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees,TempHot
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281,True
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275,True
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277,True
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345,False
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333,False

In [12]:
#Get Max of Temperature
df['Temperature'].max()

78

In [ ]:
#Get Max of Humidity
df['Humidity'].max()

In [15]:
# Convert a dictionary to DataFrame

data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}

df_new = pd.DataFrame(data)

In [17]:
#Print and see
df_new.head()

    name  reports  year
0  Jason        4  2012
1  Molly       24  2012
2   Tina       31  2013
3   Jake        2  2014
4    Amy        3  2014

In [4]:
#Understanding the type of dataframe
type(df)

pandas.core.frame.DataFrame

In [5]:
type(df['Temperature'])

pandas.core.series.Series

In [20]:
#Loading data from excel
df_excel = pd.read_excel("weather_data.xlsx","Sheet1")

In [22]:
df_excel.head()

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow